# print("     ")

# # 1
# Виведіть повідомлення Hello, Python! на екран n разів (n - ціле число, яке вводить користувач).
# n = int(input("Enter number: "))
# for i in range(n):  #делает последовательность нужной длины
#     print("Hello, Python!")

# for _ in range(int(input("Enter number: "))):
#     print("Hello, Python!")

# # 2
# Дано два цілих числа a і b (a ≤ b). Виведіть всі числа від a до b включно.

# a = int(input("Enter number: "))
# b = int(input("Enter number: "))
# for i in range(a, b+1):
#     print(i)


# # 3
# Напишіть програму-таймер зворотного відліку, яка запитує у користувача кількість секунд n, з якої слід починати відлік.
# Вхідні дані:
# 5
# Вихідні дані:
# 5
# 4
# 3
# 2
# 1
# Start!

# import time # подключаем модуль тайм
# n = int(input("Enter number: "))
# for i in range(n, 0, -1):
#     print(i)  #если бы я сдесь написала сразу общий принт, то он бы мне вывел все 5 раз Start!, поэтому сначала выводим числа, а потом отдельно надо еще один принт со стартом
#     time.sleep(1) # деламаем паузу 1 сек

# print("Start!")


# # 4
# Користувач вводить кількість навчальних предметів n, а потім, відповідно, оцінки учня з n навчальних предметів. Визначте середню оцінку.

# n = int(input("number of items: "))
# total = 0
# for i in range(n):
#     mark = int(input("number of grade: "))
#     total = total + mark
# average = total / n
# print("average grade: ", average) 

# # 5
# Надрукувати у рядку m разів число n. Числа m і n - цілі числа, які вводить користувач у порядку n, m.
# Вхідні дані:
# 10
# 5
# Вихідні дані:
# 10 10 10 10 10

# n = int(input("Enter number n: "))
# m = int(input("Enter number m: "))
# for i in range(m):#цикл повторяется м раз
#      print(n, end=" ") #вместо перехода на новый ряд - end=" " - стаывит пробел


# # 6
# Напишіть програму для друку цілих чисел від n до 0 із виведенням біля кожного числа кількості символів #, що дорівнює значенню числа.
# Вхідні дані:
# 6
# Вихідні дані:
# 6 ######
# 5 #####
# 4 ####
# 3 ###
# 2 ##
# 1 #

# n = int(input("Enter number: "))
# # for i in range(n, 0, -1):
# #     print(i, "#" * i)   # функция "#" * i  умножение ряда, делает н ряд с симфолом решетка

# while n > 0:   # цикл вай повторяется столько, пока н больше 0
#     print(n, "#" * n)
#     # n -= 1

# def coundown(n):
#     if n == 0:
#         return
#     print(n, "#" * n)
#     coundown(n - 1)
# n = int(input("Enter number: "))
# coundown(n)


# # 7
# Напишіть програму для побудови шаблону як у вихідних даних за введеним значенням n.
# Вхідні дані:
# 9
# Вихідні дані:
# 1
# 22
# 333
# 4444
# 55555
# 666666
# 7777777
# 88888888
# 999999999

# n = int(input("Enter number: "))
# for i in range(1, n + 1):
#     print(str(i) * i)     # ряд из i повторов цифры i, если i = 4, то "4" * 4 = "4444" 

# i = 1
# while i <= n:
#     print(str(i) * i)
#     i += 1

# Middle level
# # 8
# Намалювати сходинки як у вихідних даних, використовуючи символи пропуску і решітки #, коли на вхід програми подається ціле число n - кількість сходинок.
# Вхідні дані:
# 4
# Вихідні дані:
# #
# ##
# ###
# ####


# # 9
# За даним цілим додатнім числом n обчисліть n! - значення факторіалу цього числа.
# Факторіал: n! = 1 * 2 * 3 * ... * (n-1) * n



# # 10
# Автогонщик в перший день ралі проїхав d км. Кожен наступний день він збільшував пробіг на 10% від пробігу попереднього дня. Через скільки днів автоспортивних змагань сумарний пробіг автомобіля за всі дні перевищить t км і яке значення сумарного пробігу? Введення даних користувачем відбувається в порядку: d, t.
# Вхідні дані:
# 10
# 200
# Вихідні дані:
# 213.84 km, 12 days

# d = float(input("Enter distance on first day: "))  # пробег первого дня
# t = float(input("Enter target total distance: "))  # цель суммарного пробега

# day = 1  # первый день
# distance = d  # пробег текущего дня
# total = d  # суммарный пробег

# while total <= t:
#     distance = distance * 1.1
#     total += distance
#     day += 1

# print(f"{total: .2f} km, {day} days")

# # d и t сразу преобразовываются в float чтобы работать с деситичными, затем day = 1 начинаем с первого дня, в цикле сначала надо увеличить пробег текущего дня на 10 проц, потом привавить к сумме , и потом увеличить счетчик дней, 