# print("     ")

# # 1
# Виведіть повідомлення Hello, Python! на екран n разів (n - ціле число, яке вводить користувач).
# n = int(input("Enter number: "))
# for i in range(n):  #делает последовательность нужной длины
#     print("Hello, Python!")

# for _ in range(int(input("Enter number: "))):
#     print("Hello, Python!")

# # 2
# Дано два цілих числа a і b (a ≤ b). Виведіть всі числа від a до b включно.

# a = int(input("Enter number: "))
# b = int(input("Enter number: "))
# for i in range(a, b+1):
#     print(i)


# # 3
# Напишіть програму-таймер зворотного відліку, яка запитує у користувача кількість секунд n, з якої слід починати відлік.
# Вхідні дані:
# 5
# Вихідні дані:
# 5
# 4
# 3
# 2
# 1
# Start!

# import time # подключаем модуль тайм
# n = int(input("Enter number: "))
# for i in range(n, 0, -1):
#     print(i)  #если бы я сдесь написала сразу общий принт, то он бы мне вывел все 5 раз Start!, поэтому сначала выводим числа, а потом отдельно надо еще один принт со стартом
#     time.sleep(1) # деламаем паузу 1 сек

# print("Start!")


# # 4
# Користувач вводить кількість навчальних предметів n, а потім, відповідно, оцінки учня з n навчальних предметів. Визначте середню оцінку.

# n = int(input("number of items: "))
# total = 0
# for i in range(n):
#     mark = int(input("number of grade: "))
#     total = total + mark
# average = total / n
# print("average grade: ", average) 

# # 5
# Надрукувати у рядку m разів число n. Числа m і n - цілі числа, які вводить користувач у порядку n, m.
# Вхідні дані:
# 10
# 5
# Вихідні дані:
# 10 10 10 10 10

# n = int(input("Enter number n: "))
# m = int(input("Enter number m: "))
# for i in range(m):#цикл повторяется м раз
#      print(n, end=" ") #вместо перехода на новый ряд - end=" " - стаывит пробел


# # 6
# Напишіть програму для друку цілих чисел від n до 0 із виведенням біля кожного числа кількості символів #, що дорівнює значенню числа.
# Вхідні дані:
# 6
# Вихідні дані:
# 6 ######
# 5 #####
# 4 ####
# 3 ###
# 2 ##
# 1 #


# # 7
# Напишіть програму для побудови шаблону як у вихідних даних за введеним значенням n.
# Вхідні дані:
# 9
# Вихідні дані:
# 1
# 22
# 333
# 4444
# 55555
# 666666
# 7777777
# 88888888
# 999999999




# Middle level
# # 8
# Намалювати сходинки як у вихідних даних, використовуючи символи пропуску і решітки #, коли на вхід програми подається ціле число n - кількість сходинок.
# Вхідні дані:
# 4
# Вихідні дані:
# #
# ##
# ###
# ####


# # 9
# За даним цілим додатнім числом n обчисліть n! - значення факторіалу цього числа.
# Факторіал: n! = 1 * 2 * 3 * ... * (n-1) * n



# # 10
# Автогонщик в перший день ралі проїхав d км. Кожен наступний день він збільшував пробіг на 10% від пробігу попереднього дня. Через скільки днів автоспортивних змагань сумарний пробіг автомобіля за всі дні перевищить t км і яке значення сумарного пробігу? Введення даних користувачем відбувається в порядку: d, t.
# Вхідні дані:
# 10
# 200
# Вихідні дані:
# 213.84 km, 12 days