# ax^2 + bx + c = 0
# a = int(input("a: "))
# b = int(input("b: "))
# c = int(input("c: "))
# print(f"Дано квадрантое уравнение {a}x²")

# for | while

# 1
# n = int(input("Enter number: "))
# for i in range(n):
#     print("Hello, Pithon!")
#     print(i)

# 2
# a = int(input("a: "))
# b = int(input("b: "))
# if a > b:
#     a, b = b, a
# for i in range(a, b + 1):
#     print(1)

# 3
# Напишіть програму-таймер зворотного відліку, яка запитує у користувача кількість секунд n, з якої слід починати відлік.

# Вхідні дані:

# 5
# Вихідні дані:

# 5
# 4
# 3
# 2
# 1
# Start!

# n = int(input("Enter sec: "))
# # for i in range(n, 0, -1):
# #     print(i)
# # print("Sart!")

# while n > 0:
#     print(n)
#     n -= 1 # n = n - 1

# print("Sart!")

# 4
# Користувач вводить кількість навчальних предметів n, 
# а потім, відповідно, оцінки учня з n навчальних предметів. 
# Визначте середню оцінку.



# 8
# Намалювати сходинки як у вихідних даних, 
# використовуючи символи пропуску і решітки #, 
# коли на вхід програми подається ціле число n - 
# кількість сходинок.

# Вхідні дані:
# 4
# Вихідні дані:
#
##
###
####

n = int(input("Count: "))
# for el in range(1, n+1):
#     print("#" * el)

while n > 0:
    print("#" * n)
    n -= 1 # n = n - 1