# print("QWERdfg34".isdigit())
# name = "Hanna"
# n = 1


# 1
# Напишіть програму, яка приймає від користувача рядок, і відображає цей рядок у верхньому і нижньому регістрах.

# text = input("Enter range: ")
# print("QWERdfg34".upper())
# print("QWERdfg34".lower())


# 2
# Скласти програму, яка запитує назву баскетбольної команди і повторює її на екрані зі словами: This is a champion!.

# team = input("Enter team name: ")
# # Enter_team_name = "dinamo"
# print(team + " This is a champion!")

# 3
# Дано натуральне число. Знайти число, що отримується при прочитанні його цифр справа наліво.

# способ 1
# n = int(input("Enter number: "))
# reversed_number = 0
# original = n
# while original > 0:
#     last_digit = original % 10 #бурум последнюю цифру
#     reversed_number = reversed_number * 10 + last_digit # добавляем ее в eversed_number
#     original = original // 10 # убираем последнюю цифру 
# print("Reversed number: ", reversed_number)

# способ 2
# n = int(input("Enter number: "))
# reversed_number = int(str(n) [::-1])
# print("Reversed number: ", reversed_number)


# 4
# Дано рядок. Змініть регістр символів в цьому рядку так, щоб перша буква кожного слова була великою, а інші літери - малими. (метод 's.title()')
# text = input("Enter text: ")    # ввожу строку, которая сохраняеься в переменной text "привіт, я люблю пайтон"
# new_text = text.title() # метод .title() делает первую букву каждого слова заглавной, остальные - маленькими "Привіт, Я Люблю Пайтон"
# print(text.title()) 


# 5
# Дано рядок. Визначити порядковий номер першої вказаної букви. Якщо такої літери немає, вивести нуль.
# text = input("Enter text: ")
# letter = input("Enter letter: ")
# new_letter = text.find(letter)
# if new_letter == -1:
#     print(0)
# else:
#     print(new_letter + 1)



# Middle level
# 6
# Напишіть програму, яка по введеному числу n від 1 до 9 виводить на екран n пінгвінів з відповідним номером - число від 1 до n. Зображення одного пінгвіна має розмір 5 x 9 символів, між двома сусідніми пінгвінами також є порожній (з пропусків) стовпець. Дозволяється вивести порожній стовпець після останнього пінгвіна. Для спрощення малювання скопіюйте пінгвіна із вихідних даних. Врахуйте, що виведення на екран виконується порядково, а не «попінгвінно».
# Вхідні дані:
# 4
# Вихідні дані:
#    _~_        _~_        _~_        _~_
#   (o o)      (o o)      (o o)      (o o)
#  /  V  \    /  V  \    /  V  \    /  V  \
# /(  1  )\  /(  2  )\  /(  3  )\  /(  4  )\
#   ^^ ^^      ^^ ^^      ^^ ^^      ^^ ^^

# 7
# У рядку є кілька слів, розділених одним або декількома пропусками. Потрібно прибрати з тексту зайві пропуски: два і більше пропусків поспіль, а також всі пропуски на початку і в кінці рядка. На вхід програмі подається рядок, що складається не більше ніж з 255 символів. Надрукувати новий рядок.
# Вхідні дані:
#     Beyond the green     swelling hills of the     Mittel Land rose mighty slopes of forest    up    to the lofty steeps of the Carpathians    themselves
# Вихідні дані:
# Beyond the green swelling hills of the Mittel Land rose mighty slopes of forest up to the lofty steeps of the Carpathians themselves


# Hard level
# 8
# Дано рядок, що складається з n цифр (тобто одноцифрових чисел), між якими стоїть n-1 знаків операцій, кожна з яких може бути або +, або -. Обчисліть значення цього виразу. Програма має надрукувати результат обчислення цього виразу.
# Вхідні дані:
# 5-3+1
# 6+3-2
# Вихідні дані:
# 3
# 7

# 9
# Напишіть програму, на вхід якої даються чотири числа a, b, c і d, кожне у своєму рядку. Програма повинна вивести фрагмент таблиці множення для всіх чисел відрізка [a; b] на всі числа відрізка [c; d]. Числа a, b, c і d є натуральними і не перевищують 10, a ≤ b, c ≤ d. Дотримуйтесь формату виведення як у вихідних даних. Для поділу елементів всередині рядка використовуйте \t - символ табуляції. Зауважте, що лівим стовпчиком і верхнім рядком виводяться самі числа із заданих відрізків.
# Вхідні дані:
# 1
# 4
# 2
# 5
# Вихідні дані:
#     2	3	4	5
# 1	2	3	4	5
# 2	4	6	8	10
# 3	6	9	12	15
# 4	8	12	16	20




# 10
# Напишіть програму для друку літери A за допомогою введеного користувачем символа.
# Вхідні дані:
# *
# Вихідні дані:
#  ***
# *   *
# *   *
# *****
# *   *
# *   *
# *   *


# 11
# Напишіть програму, яка визначає, чи є у введеному рядку десяткові цифри, і виводить найбільше число, яке можна скласти з цих цифр. Провідних нулів у числі бути не повинно (за винятком числа 0, запис якого містить рівно одну цифру). Гарантовано, що у рядку є принаймні одна цифра. Вхідний рядок містить довільні символи. Програма повинна вивести найбільше число, яке можна скласти з присутніх в рядку десяткових цифр.
# Вхідні дані:
# Release Date: July 27, 2008
# Last Updated: February 22, 2018
# Вихідні дані:
# 872200
# 822210