# Сума двох чисел: Написати програму, яка зчитує два цілих числа та виводить їх суму.
n1 = int(input("Enter number1: "))
n2 = int(input("Enter number2: "))
print(n1 + n2)

# Гіпотенуза: За двома катета ми прямокутного трикутника знайти довжину його гіпотенузи.


# Двічі: Написати програму, яка зчитує ціле число та виводить його двічі.


# Привіт, «імʼя>: Написати програму, яка запитує імʼя користувача і виводить привітання.


# Прощавай, «імʼя>: Написати програму, яка запитує імʼя користувача і виводить прощання.