# Сума двох чисел: Написати програму, яка зчитує два цілих числа та виводить їх суму.
# n1 = int(input("Enter number1: "))
# n2 = int(input("Enter number2: "))
# print(n1 + n2)
#
# Гіпотенуза: За двома катета ми прямокутного трикутника знайти довжину його гіпотенузи.
# n3 = float(input("Enter number1: "))
# n4 = float(input("Enter number2: "))
# print(((n3) ** 2) + ((n4) ** 2) ** 0.5)
#
# Двічі: Написати програму, яка зчитує ціле число та виводить його двічі.
# n5 = int(input("Enter number1: "))
# print("n5" * 2)
#
# Привіт, «імʼя>: Написати програму, яка запитує імʼя користувача і виводить привітання.
# name = input("Name:")
# print("Hello, ", name) 
#
# Прощавай, «імʼя>: Написати програму, яка запитує імʼя користувача і виводить прощання.
# n8 = str(input("Прощавай,"))
# n9 = str(input("Enter name1: "))
# print(n8 + n9)