# Задача 1. Середнє трьох чисел
# Користувач вводить три числа. Обчисли середнє арифметичне.
# num1 = float(input("Введіть перше число: "))
# num2 = float(input("Введіть друге число: "))
# num3 = float(input("Введіть третє число: "))
# average = (num1 + num2 + num3) / 3
# print(f"Середнє арифметичне трьох чисел: {average:.2f}")

# Задача 2. Остача від ділення
# Користувач вводить два числа. Знайди остачу від ділення першого на друге.
# num1 = int(input("Введіть перше число: "))
# num2 = int(input("Введіть друге число: "))
# remainder = num1 % num2
# print(f"Остача від ділення {num1} на {num2} дорівнює {remainder}.")

# Задача 3. Подвоєне число
# Користувач вводить число. Виведи подвоєне значення цього числа.
# num = float(input("Введіть число: "))
# doubled = num * 2
# print(f"Подвоєне значення числа {num} дорівнює {doubled}.")

# Задача 4. Конвертація хвилин у секунди
# Користувач вводить кількість хвилин. Обчисли, скільки це буде секунд.
# minutes = float(input("Введіть кількість хвилин: "))
# seconds = minutes * 60
# print(f"{minutes} хвилин = {seconds} секунд.")

# Задача 5. Кількість яблук на кожного
# Є n яблук і k учнів. Скільки яблук отримає кожен учень, якщо ділити порівну, і скільки залишиться?
# n = int(input("Введіть кількість яблук: "))
# k = int(input("Введіть кількість учнів: "))
# apples_per_student = n // k
# remaining_apples = n % k
# print(f"Кожен учень отримає {apples_per_student} яблук, а залишиться {remaining_apples} яблук.")

# Задача 6. Остання цифра числа
# Користувач вводить число. Виведи його останню цифру.
# num = int(input("Введіть число: ")) 
# print(num % 10)

# Задача 7*. Обмін змінних
# Користувач вводить два числа. Після цього потрібно “поміняти” їх місцями і вивести результат.
# a = float(input("Введіть перше число: "))
# b = float(input("Введіть друге число: "))
# a, b = b, a
# print(f"Після обміну: перше число = {a}, друге число = {b}")

# Ви придбали товар на певну суму s. Скільки купюр різного номіналу треба віддати продавцю,
# якщо починати платити з найбільших? У вас є 1, 2, 5, 10, 100, 500 гривень.
# sum = float(input ("Enter sum: "))
# money_500 = sum // 500
# sum = sum % 500

# money_100 = sum // 100
# sum = sum % 100

# money_10 = sum // 10
# sum = sum % 10

# money_5 = sum // 5
# sum = sum % 5

# money_2 = sum // 2
# sum = sum % 2

# money_1 = sum // 1
# sum = sum % 1
# print ("count 500 ", money_500)
# print("count 100 ", money_100)
# print("count 10", money_10)
# print("count 2 ", money_2)
# print("count 1", money_1)