# Сума двох чисел: Написати програму, яка зчитує два цілих числа та виводить їх суму.
# n1 = int(input("Enter number1: "))
# n2 = int(input("Enter number2: "))
# print(n1 + n2)
#
# Гіпотенуза: За двома катета ми прямокутного трикутника знайти довжину його гіпотенузи.
# n3 = float(input("Enter number1: "))
# n4 = float(input("Enter number2: "))
# print(((n3) ** 2) + ((n4) ** 2) ** 0.5)
#
# Двічі: Написати програму, яка зчитує ціле число та виводить його двічі.
# n5 = int(input("Enter number1: "))
# print((str(n5) + " ") * 2)
#
# Привіт, «імʼя>: Написати програму, яка запитує імʼя користувача і виводить привітання.
# name = input("Name:")
# print("Hello, ", name) 
#
# Прощавай, «імʼя>: Написати програму, яка запитує імʼя користувача і виводить прощання.
# n8 = str(input("Прощавай,"))
# n9 = str(input("Enter name1: "))
# print(n8 + n9)

# Вік через рік: Напишіть програму, яка запитує ім'я користувача та його вік. Потім виведіть повідомлення, яке повідомляє, скільки йому буде років через рік. 
# name = input("Введіть ваше ім'я: ")
# age = int(input("Введіть ваш вік: "))
# next_year_age = age + 1
# print(f"{name}, через рік вам буде {next_year_age} років.")

# Площа прямокутника: Напишіть програму, яка запитує довжину та ширину прямокутника, а потім обчислює та виводить його площу. 
# length = float(input("Введіть довжину прямокутника: "))
# width = float(input("Введіть ширину прямокутника: "))
# area = length * width
# print(f"Площа прямокутника дорівнює {area}")

# Конвертер валют: Запропонуйте користувачеві ввести суму в одній валюті (наприклад, доларах), а потім виведіть цю суму в іншій валюті (наприклад, євро), використовуючи заздалегідь визначений коефіцієнт обміну. 
# usd = float(input("Введіть суму в доларах (USD): "))
# exchange_rate = 0.86
# eur = usd * exchange_rate
# print(f"{usd} доларів = {eur:.2f} євро")

# Вартість покупки: Запитайте користувача назву товару, його ціну та кількість. Обчисліть загальну вартість покупки та виведіть її на екран. 
# item_name = input("Введіть назву товару: ")
# price = float(input(f"Введіть ціну товару '{item_name}': "))
# quantity = int(input(f"Введіть кількість товару '{item_name}': "))
# total_cost = price * quantity
# print(f"Загальна вартість покупки '{item_name}' ({quantity} шт.) складає {total_cost:.2f} грн.")

# Температура: Напишіть програму, яка перетворює температуру з градусів Цельсія на Фаренгейт. Запитайте користувача температуру в градусах Цельсія.
# celsius = float(input("Введіть температуру в градусах Цельсія: "))
# fahrenheit = (celsius * 9/5) + 32
# print(f"{celsius}°C = {fahrenheit:.2f}°F")